//=============================================================================
// プレイヤーのモーション処理 [motion_player.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _MOTION_PLAYER_H_
#define _MOTION_PLAYER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "motion.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CMotionPlayer : public CMotion
{
public:
	CMotionPlayer();									// コンストラクタ
	~CMotionPlayer();									// デストラクタ
	HRESULT Init(CScene *pScene);						// 初期化処理
	void Uninit(void);									// 終了処理
	void Update(CScene *pScene);						// 更新処理
	static CMotionPlayer *Create(CScene *pScene);		// 生成処理
};
#endif // _MOTION_PLAYER_H_