//=============================================================================
// ボスのモーション処理 [motion_boss.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _MOTION_BOSS_H_
#define _MOTION_BOSS_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "motion.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CMotionBoss : public CMotion
{
public:
	CMotionBoss();									// コンストラクタ
	~CMotionBoss();									// デストラクタ
	HRESULT Init(CScene *pScene);					// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(CScene *pScene);					// 更新処理
	static CMotionBoss *Create(CScene *pScene);		// 生成処理
};
#endif // _MOTION_BOSS_H_